
## Plan Result




<pre><code>Plan: 5 to add, 6 to change, 0 to destroy.</code></pre>

* Create
  * module.notifications-queue-premium.azurerm_servicebus_queue.servicebus_queue
  * module.notifications-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.notifications-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule
  * module.queue-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace
  * module.queue-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
* Update
  * azurerm_key_vault_secret.notification_queue_listen_access_key_premium
  * azurerm_key_vault_secret.notification_queue_send_access_key_premium
  * azurerm_key_vault_secret.notifications_queue_listen_conn_str_premium
  * azurerm_key_vault_secret.notifications_queue_send_conn_str_premium
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.notification_queue_listen_access_key_premium will be updated in-place
  ~ resource "azurerm_key_vault_secret" "notification_queue_listen_access_key_premium" {
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-queue-listen-shared-access-key-premium/01d5e60273424936922127d48421d150"
        name                    = "notification-queue-listen-shared-access-key-premium"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.notification_queue_send_access_key_premium will be updated in-place
  ~ resource "azurerm_key_vault_secret" "notification_queue_send_access_key_premium" {
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notification-queue-send-shared-access-key-premium/08fedbca3e2d489786e35d1f2b402ecb"
        name                    = "notification-queue-send-shared-access-key-premium"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.notifications_queue_listen_conn_str_premium will be updated in-place
  ~ resource "azurerm_key_vault_secret" "notifications_queue_listen_conn_str_premium" {
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notifications-queue-listen-connection-string-premium/a0266c8bcea64376a0d598e238d1972b"
        name                    = "notifications-queue-listen-connection-string-premium"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.notifications_queue_send_conn_str_premium will be updated in-place
  ~ resource "azurerm_key_vault_secret" "notifications_queue_send_conn_str_premium" {
        id                      = "https://reform-scan-aat.vault.azure.net/secrets/notifications-queue-send-connection-string-premium/68d01b53390647a3b95210e3ce487ac7"
        name                    = "notifications-queue-send-connection-string-premium"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.Resources/deployments/Reform_Scan"
        name                     = "Reform_Scan"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.notifications-queue-premium.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT59M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT5M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "notifications"
      + namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium"
      + requires_duplicate_detection            = true
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.notifications-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.notifications-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.queue-namespace-premium.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 0
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + minimum_tls_version                 = (known after apply)
      + name                                = "reform-scan-servicebus-aat-premium"
      + public_network_access_enabled       = true
      + resource_group_name                 = "reform-scan-aat"
      + sku                                 = "Standard"
      + tags                                = {
          + "Team Contact"        = "#rbs"
          + "Team Name"           = "Bulk Scan"
          + "application"         = "bulk-scan-print"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/reform-scan-shared-infra.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#rbs"
          + "environment"         = "staging"
          + "managedBy"           = "Bulk Scanning and Printing"
        }
      + zone_redundant                      = false

      + network_rule_set {
          + default_action                = (known after apply)
          + ip_rules                      = (known after apply)
          + public_network_access_enabled = (known after apply)
          + trusted_services_allowed      = (known after apply)

          + network_rules {
              + ignore_missing_vnet_service_endpoint = (known after apply)
              + subnet_id                            = (known after apply)
            }
        }
    }

  # module.queue-namespace-premium.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat|reform-scan-aat"
        name                           = "reform-scan-aat"
        # (3 unchanged attributes hidden)



      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 6 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.notifications-queue-premium.azurerm_servicebus_queue.servicebus_queue has been deleted
  - resource "azurerm_servicebus_queue" "servicebus_queue" {
      - auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> null
      - dead_lettering_on_message_expiration    = true -> null
      - default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> null
      - duplicate_detection_history_time_window = "PT59M" -> null
      - enable_batched_operations               = true -> null
      - enable_express                          = false -> null
      - enable_partitioning                     = false -> null
      - id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium/queues/notifications" -> null
      - lock_duration                           = "PT5M" -> null
      - max_delivery_count                      = 10 -> null
      - max_message_size_in_kilobytes           = 1024 -> null
      - max_size_in_megabytes                   = 1024 -> null
      - name                                    = "notifications" -> null
      - namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium" -> null
      - requires_duplicate_detection            = true -> null
      - requires_session                        = false -> null
      - status                                  = "Active" -> null
    }

  # module.notifications-queue-premium.azurerm_servicebus_queue_authorization_rule.listen_auth_rule has been deleted
  - resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium/queues/notifications/authorizationRules/ListenSharedAccessKey" -> null
      - listen                      = true -> null
      - manage                      = false -> null
      - name                        = "ListenSharedAccessKey" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - queue_id                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium/queues/notifications" -> null
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = false -> null
    }

  # module.notifications-queue-premium.azurerm_servicebus_queue_authorization_rule.send_auth_rule has been deleted
  - resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      - id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium/queues/notifications/authorizationRules/SendSharedAccessKey" -> null
      - listen                      = false -> null
      - manage                      = false -> null
      - name                        = "SendSharedAccessKey" -> null
      - primary_connection_string   = (sensitive value)
      - primary_key                 = (sensitive value)
      - queue_id                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.ServiceBus/namespaces/reform-scan-servicebus-aat-premium/queues/notifications" -> null
      - secondary_connection_string = (sensitive value)
      - secondary_key               = (sensitive value)
      - send                        = true -> null
    }

  # module.vault.azurerm_monitor_diagnostic_setting.kv-ds has changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat|reform-scan-aat"
        name                           = "reform-scan-aat"
        # (3 unchanged attributes hidden)



      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":133,"Program":"tfcmt","SHA1":"","Vars":{}} -->